Repository: PBoudreau/HarmonyX
Catalog: HarmonyX/*.lproj/Localizable.strings
Languages: fr

# GENERAL-CANCEL
source: Cancel
fr: Annuler

# GENERAL-UNKNOWN_ERROR
source: unknown error
fr: erreur inconnue

# FSCHARMONYCLIENT-MY_HARMONY-RESPONSE_FORMAT-MISSING_GETUSERAUTHTOKENRESULT
source: Could not find user auth token result keyed on 'GetUserAuthTokenResult' in JSON: %@
fr: Impossible de localiser l'attribut 'GetUserAuthTokenResult' dans le JSON: %@

# FSCHARMONYCLIENT-MY_HARMONY-RESPONSE_FORMAT-MISSING_USERAUTHTOKEN
source: Could not find token keyed on 'UserAuthToken' in JSON: %@
fr: Impossible de localiser l'attribut 'UserAuthToken' dans le JSON: %@

# FSCHARMONYCLIENT-MY_HARMONY-RESPONSE_FORMAT-ERROR_IN_GETUSERTOKEN
source: An error occurred in GetUserToken: %@
fr: Une erreur est survenue dans GetUserToken: %@

# FSCHARMONYCLIENT-MY_HARMONY-RESPONSE_FORMAT-ERROR_REQUESTING_MY_HARMONHY_TOKEN
source: An error occurred while requesting My Harmony token: %@
fr: Une erreur est survenue durant l'obtention du jeton My Harmony: %@

# FSCHARMONYCLIENT-HARMONY_HUB-CONNECTION_ERROR-COULD_NOT_CONNECT
source: Could not connect to Harmony Hub: %@
fr: La connexion au Harmony Hub a échoué: %@

# FSCHARMONYCLIENT-HARMONY_HUB-CONNECTION_ERROR-COULD_NOT_AUTHENTICATE
source: Could not authenticate to Harmony Hub: %@
fr: L'authentification au Harmony Hub a échoué: %@

# FSCHARMONYCLIENT-HARMONY_HUB-CONNECTION_ERROR-XMPP_STREAM_ALREADY_CONNECTED
source: XMPP Stream is already connected
fr: Le stream XMPP est déjà connecté

# FSCHARMONYCLIENT-HARMONY_HUB-API-UNEXPECTED_RESPONSE-PAIR
source: Unexpected 'pair' API response from HUB: %@
fr: Réponse inattendue du HUB pour l'API 'pair': %@

# FSCHARMONYCLIENT-HARMONY_HUB-API-UNEXPECTED_RESPONSE-CONFIG
source: Unexpected 'config' API response from HUB: %@
fr: Réponse inattendue du HUB pour l'API 'config': %@

# FSCHARMONYCLIENT-HARMONY_HUB-API-UNEXPECTED_RESPONSE-GET_CURRENT_ACTIVITY
source: Unexpected 'getCurrentActivity' API response from HUB: %@
fr: Réponse inattendue du HUB pour l'API 'getCurrentActivity': %@

# FSCHARMONYVIEWCONTROLLER-MY_HARMONY-CONNECTION_ERROR-SETUP
source: Could not connect to Harmony Hub with the provided IP address and port.
fr: La connexion à My harmony a échoué: vérifiez l'adresse IP et le port.

# FSCHARMONYVIEWCONTROLLER-MY_HARMONY-CONNECTION_ERROR-CREDENTIALS
source: Could not connect to My Harmony with the provided credentials. Please verify that your username and password are correct.
fr: La connexion à My harmony a échoué: vérifiez votre nom d'usager et mot de passe.

# VIEWCONTROLLER-CREDENTIALS_AND_SETUP_VALIDATION-MISSING_USERNAME
source: Username is required.
fr: Veuillez fournier votre nom d'usager.

# VIEWCONTROLLER-CREDENTIALS_AND_SETUP_VALIDATION-MISSING_PASSWORD
source: Password is required.
fr: Veuillez fournier votre mot de passe.

# VIEWCONTROLLER-CREDENTIALS_AND_SETUP_VALIDATION-MISSING_IP_ADDRESS
source: IP Address is required.
fr: Veuillez spécifier l'adresse IP.

# VIEWCONTROLLER-CREDENTIALS_AND_SETUP_VALIDATION-INVALID_PORT
source: Invalid port number.
fr: Numéro de port non-valide.

# VIEWCONTROLLER-HARMONY_LABEL_TAPPED-ACTION_SHEET-TITLE
source: What would you like to do?
fr: Faites votre choix:

# VIEWCONTROLLER-HARMONY_LABEL_TAPPED-ACTION_SHEET-BUTTON-FLUSH_TOKENS
source: Flush Tokens
fr: Effacer jeton
